Revit 2027 API
RebarHookType.IsOffsetLengthRequired Method
 Check whether hook offset length is required. remarks: If hook angle is no more than 90 degree, hook offset length is not meaningful. returns: True if hook offset length is required, otherwise false.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsOffsetLengthRequired()
Public Function IsOffsetLengthRequired As Boolean
public:
bool IsOffsetLengthRequired()
member IsOffsetLengthRequired : unit -> bool
Return Value
Boolean
See Also
Reference
RebarHookType Class
Autodesk.Revit.DB.Structure Namespace